installationOSX.org
#+STARTUP: inlineimages
#+LANGUAGE: fr
#+LATEX_HEADER: \usepackage[AUTO]{babel}
#+LaTeX_HEADER: \usepackage[x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = black}
#+TITLE: Gestion des notes 
#+SUBTITLE: (Projet DIU)
#+OPTIONS: toc:2  
#+AUTHOR: Raoul HATTERER

# This is an org-mode document with litterate programming
# C-' to edit the code bloc
# C-c C-c to execute the code bloc
# M-x org-redisplay-inline-images (C-c C-x C-M-v) will refresh in-lined image if needed.
# C-c C-x C-v toggle preview
# C-c C-o to follow link
#  C-c C , s to insert a src block.
# C-c C-v t tangle the current file

# La première page contient le titre et la table des matières
#+LATEX: \newpage


* Installations et paramétrages
  *Remarque*: Certaines parties concernent plus spécifiquement mon utilisation personnelle avec [[https://emacsformacosx.com][emacs sous OSX]].

** Installer Homebrew

   Pour installer MariaDB, il faut disposer de [[https://brew.sh/index_fr][Homebrew]] (The Missing Package Manager for macOS).

** Installer MariaDB

   MariaDB Server peut ensuite être installé grâce à cette commande:

   #+NAME: mariadbinstallation
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
   #+BEGIN_SRC shell
     brew update
     brew install mariadb
   #+END_SRC

** Démarrer MariaDB Server
   Après installation, on peut (mais on ne va pas le faire) démarrer le serveur avec la commande:
   #+NAME: mariadbstart
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
   #+BEGIN_SRC shell
     mysql.server start
   #+END_SRC
   
   Il est plus commode d'activer le démarrage automatique du serveur:

   #+NAME: mariadbautostart
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
   #+BEGIN_SRC shell
     brew services start mariadb
   #+END_SRC

** Vérifier que MariaDB a démarré

   #+NAME: serviceslist
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
   #+BEGIN_SRC shell
     brew services list
   #+END_SRC

** Client-serveur

   Comme la plupart des SGBD ([S]ystème de [G]estion de [B]ase de [D]onnées), MariaDB est basée sur le *modèle client-serveur*. Cela implique que la base de données se trouve sur un *serveur* auquel nous n'avons pas accès directement. Il faut passer par un *client* qui fera la liaison entre nous et le serveur.

   Donc, maintenant que  MariaDB Server a démarré, on va s'y connecter en utilisant un logiciel client (nommé ~mysql~)... mais sous quelle identité et avec quels droits?

** Distinguer les utilisateurs

*** Types d'utilisateurs

    Il faut distinguer trois types d'utilisateur d'un SGBD ayant chacun des rôles bien distincts :
    1. L'*administrateur* du SGBD et donc des Bases de Données. Il s'appelle ~root~. Son rôle est d'installer et gérer le SGBD dans sa globalité. Chaque fois que l'administrateur crée une base de données, il délègue sa gestion à un autre utilisateur à qui il donne les droits nécessaires. *Remarque:*  Il ne faut pas travailler sur une bases de données en tant que ~root~; ce n'est pas son rôle ([[https://www.youtube.com/watch?v=oiQG6tP3940][c'est mal]]).
    2. Le *gestionnaire* de Bases de Données (dans un SGBD existant) qui doit connaître  *sql* (Structured Query Language) : création (CREATE TABLE), modification (ALTER TABLE), suppression (DROP TABLE) de tables...     
    3. L'*utilisateur* de bases de données (il va interagir avec la base de donnée à travers une application se voulant conviviale; il n'a pas à connaître *sql*).



