installationOSX.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2020-02-20 Thu 12:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gestion des notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Raoul HATTERER" />
</head>
<body>
<div id="content">
<h1 class="title">Gestion des notes
<br />
<span class="subtitle">(Projet DIU)</span>
</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9fdc5b6">1. Installations et paramétrages</a>
<ul>
<li><a href="#org1075f24">1.1. Installer Homebrew</a></li>
<li><a href="#orgaf0388e">1.2. Installer MariaDB</a></li>
<li><a href="#org6d34c8b">1.3. Démarrer MariaDB Server</a></li>
<li><a href="#org1d02812">1.4. Vérifier que MariaDB a démarré</a></li>
<li><a href="#org685fa1a">1.5. Client-serveur</a></li>
<li><a href="#org34ffc82">1.6. Distinguer les utilisateurs</a></li>
<li><a href="#org37e075d">1.7. Création d'une nouvelle base de données et d'un gestionnaire pour assurer sa gestion</a></li>
</ul>
</li>
<li><a href="#orge2193bf">2. Afficher les utilisateurs</a>
<ul>
<li><a href="#org1d8092f">2.1. Afficher tous les utilisateurs (en tant qu'administrateur)</a></li>
<li><a href="#org54b6b1a">2.2. Afficher l'utilisateur connecté</a></li>
</ul>
</li>
<li><a href="#org5984159">3. Gestion de la base de données</a>
<ul>
<li><a href="#orgf0fdbe1">3.1. Se connecter au client <code>mysql</code> en tant que gestionnaire</a></li>
<li><a href="#org8055562">3.2. Lister les bases de données (auxquelles le gestionnaire a accès)</a></li>
<li><a href="#orgf0baed5">3.3. Se connecter à une base de données</a></li>
<li><a href="#orgc85dbc7">3.4. Afficher les tables de la base courante</a></li>
<li><a href="#orga9be747">3.5. Afficher la structure de la table</a></li>
<li><a href="#org0d45def">3.6. Créer une nouvelle table</a></li>
<li><a href="#org1d49039">3.7. Ajouter une colonne à une table</a></li>
<li><a href="#orgb4f0e09">3.8. Effacer une colonne</a></li>
<li><a href="#org62732fc">3.9. Effacer une table</a></li>
<li><a href="#orgbadb7a5">3.10. Afficher le contenu de la table</a></li>
</ul>
</li>
<li><a href="#orgd208426">4. sql-mode dans emacs</a>
<ul>
<li><a href="#orgb56953d">4.1. Se connecter au serveur dans emacs</a></li>
<li><a href="#org79ce72a">4.2. Si emacs ne trouve pas le programme mysql</a></li>
<li><a href="#org639aa5c">4.3. Connexion facilitée</a></li>
<li><a href="#orgc3a75d1">4.4. SQL-UPCASE</a></li>
</ul>
</li>
<li><a href="#org1a5937e">5. How to run sql script</a></li>
<li><a href="#orgca7534d">6. Python tkinter table widget for displaying tabular data</a>
<ul>
<li><a href="#org16ca30f">6.1. installation</a></li>
<li><a href="#org16dc7df">6.2. source</a></li>
<li><a href="#org256c095">6.3. paramètres</a></li>
<li><a href="#org4c510eb">6.4. fonctions</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org9fdc5b6" class="outline-2">
<h2 id="org9fdc5b6"><span class="section-number-2">1</span> Installations et paramétrages</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Remarque</b>: Certaines parties concernent plus spécifiquement mon utilisation personnelle avec <a href="https://emacsformacosx.com">emacs sous OSX</a>.
</p>
</div>

<div id="outline-container-org1075f24" class="outline-3">
<h3 id="org1075f24"><span class="section-number-3">1.1</span> Installer Homebrew</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Pour installer MariaDB, il faut disposer de <a href="https://brew.sh/index_fr">Homebrew</a> (The Missing Package Manager for macOS).
</p>
</div>
</div>

<div id="outline-container-orgaf0388e" class="outline-3">
<h3 id="orgaf0388e"><span class="section-number-3">1.2</span> Installer MariaDB</h3>
<div class="outline-text-3" id="text-1-2">
<p>
MariaDB Server peut ensuite être installé grâce à cette commande:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org452acef">brew update
brew install mariadb
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d34c8b" class="outline-3">
<h3 id="org6d34c8b"><span class="section-number-3">1.3</span> Démarrer MariaDB Server</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Après installation, on peut (mais on ne va pas le faire) démarrer le serveur avec la commande:
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org9deb250">mysql.server start
</pre>
</div>

<p>
Il est plus commode d'activer le démarrage automatique du serveur:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org8fbed45">brew services start mariadb
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d02812" class="outline-3">
<h3 id="org1d02812"><span class="section-number-3">1.4</span> Vérifier que MariaDB a démarré</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell" id="org5bf8b02">brew services list
</pre>
</div>
</div>
</div>

<div id="outline-container-org685fa1a" class="outline-3">
<h3 id="org685fa1a"><span class="section-number-3">1.5</span> Client-serveur</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Comme la plupart des SGBD ([S]ystème de [G]estion de [B]ase de [D]onnées), MariaDB est basée sur le <b>modèle client-serveur</b>. Cela implique que la base de données se trouve sur un <b>serveur</b> auquel nous n'avons pas accès directement. Il faut passer par un <b>client</b> qui fera la liaison entre nous et le serveur.
</p>

<p>
Donc, maintenant que  MariaDB Server a démarré, on va s'y connecter en utilisant un logiciel client (nommé <code>mysql</code>)&#x2026; mais sous quelle identité et avec quels droits?
</p>
</div>
</div>

<div id="outline-container-org34ffc82" class="outline-3">
<h3 id="org34ffc82"><span class="section-number-3">1.6</span> Distinguer les utilisateurs</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-orgd3e5f38" class="outline-4">
<h4 id="orgd3e5f38"><span class="section-number-4">1.6.1</span> Types d'utilisateurs</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Il faut distinguer trois types d'utilisateur d'un SGBD ayant chacun des rôles bien distincts :
</p>
<ol class="org-ol">
<li>L'<b>administrateur</b> du SGBD et donc des Bases de Données. Il s'appelle <code>root</code>. Son rôle est d'installer et gérer le SGBD dans sa globalité. Chaque fois que l'administrateur crée une base de données, il délègue sa gestion à un autre utilisateur à qui il donne les droits nécessaires. <b>Remarque:</b>  Il ne faut pas travailler sur une bases de données en tant que <code>root</code>; ce n'est pas son rôle (<a href="https://www.youtube.com/watch?v=oiQG6tP3940">c'est mal</a>).</li>
<li>Le <b>gestionnaire</b> de Bases de Données (dans un SGBD existant) qui doit connaître  <b>sql</b> (Structured Query Language) : création (CREATE TABLE), modification (ALTER TABLE), suppression (DROP TABLE) de tables&#x2026;</li>
<li>L'<b>utilisateur</b> de bases de données (il va interagir avec la base de donnée à travers une application se voulant conviviale; il n'a pas à connaître <b>sql</b>).</li>
</ol>
</div>
</div>
