installationOSX.tex
% Created 2020-02-20 Thu 01:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[frenchb]{babel}
\usepackage[x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = black}
\author{Raoul HATTERER}
\date{\today}
\title{Gestion des notes\\\medskip
\large (Projet DIU)}
\hypersetup{
 pdfauthor={Raoul HATTERER},
 pdftitle={Gestion des notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={Frenchb}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage


\section{Installations et paramétrages}
\label{sec:orgb8900ab}
\textbf{Remarque}: Certaines parties concernent plus spécifiquement mon utilisation personnelle avec \href{https://emacsformacosx.com}{emacs sous OSX}.

\subsection{Installer Homebrew}
\label{sec:org8a40175}

Pour installer MariaDB, il faut disposer de \href{https://brew.sh/index\_fr}{Homebrew} (The Missing Package Manager for macOS).

\subsection{Installer MariaDB}
\label{sec:orgfbd4eea}

MariaDB Server peut ensuite être installé grâce à cette commande:

\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
brew update
brew install mariadb
\end{minted}

\subsection{Démarrer MariaDB Server}
\label{sec:org37d22bf}
Après installation, on peut (mais on ne va pas le faire) démarrer le serveur avec la commande:
\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
mysql.server start
\end{minted}

Il est plus commode d'activer le démarrage automatique du serveur:

\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
brew services start mariadb
\end{minted}

\subsection{Vérifier que MariaDB a démarré}
\label{sec:org6cf8bdd}

\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
brew services list
\end{minted}

\subsection{Client-serveur}
\label{sec:org7fe9b6e}

Comme la plupart des SGBD ([S]ystème de [G]estion de [B]ase de [D]onnées), MariaDB est basée sur le \textbf{modèle client-serveur}. Cela implique que la base de données se trouve sur un \textbf{serveur} auquel nous n'avons pas accès directement. Il faut passer par un \textbf{client} qui fera la liaison entre nous et le serveur.

Donc, maintenant que  MariaDB Server a démarré, on va s'y connecter en utilisant un logiciel client (nommé \texttt{mysql})\ldots{} mais sous quelle identité et avec quels droits?

\subsection{Distinguer les utilisateurs}
\label{sec:orgb7b8813}

\subsubsection{Types d'utilisateurs}
\label{sec:orgbcd1622}

Il faut distinguer trois types d'utilisateur d'un SGBD ayant chacun des rôles bien distincts :
\begin{enumerate}
\item L'\textbf{administrateur} du SGBD et donc des Bases de Données. Il s'appelle \texttt{root}. Son rôle est d'installer et gérer le SGBD dans sa globalité. Chaque fois que l'administrateur crée une base de données, il délègue sa gestion à un autre utilisateur à qui il donne les droits nécessaires. \textbf{Remarque:}  Il ne faut pas travailler sur une bases de données en tant que \texttt{root}; ce n'est pas son rôle (\href{https://www.youtube.com/watch?v=oiQG6tP3940}{c'est mal}).
\item Le \textbf{gestionnaire} de Bases de Données (dans un SGBD existant) qui doit connaître  \textbf{sql} (Structured Query Language) : création (CREATE TABLE), modification (ALTER TABLE), suppression (DROP TABLE) de tables\ldots{}
\item L'\textbf{utilisateur} de bases de données (il va interagir avec la base de donnée à travers une application se voulant conviviale; il n'a pas à connaître \textbf{sql}).
\end{enumerate}
