installationOSX.org
*** À la création

   *À la création, la base de donnée est initialisée avec 2 comptes:* 
- le premier correspond au nom d'utilisateur actuel (checké avec la commande ~whoami~); il ne nécessite pas de mot de passe;
- tandis que le second est le compte administrateur ~root~ ; il est inaccessible tant qu'on n'a pas défini de mot de passe.

On va donc faire ce qu'il faut pour activer l'accès au compte administrateur (root) puis s'y connecter pour créer une base de données (~bd_gestion_des_notes~) et un compte gestionnaire.  

*** Activer l'accès au compte ~root~
    
    Pour cela, d'abord se connecter au client *mysql*  avec son nom d'utilisateur:

    #+NAME: whoam
    #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
    #+BEGIN_SRC shell
      mysql -u $(whoami)
    #+END_SRC
    
    Puis, grâce au commandes du client *mysql*, définir le mot de passe de ~root~:
 
    #+NAME: setrootpwd
    #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t
    #+BEGIN_SRC sql
      SHOW databases;
      USE mysql;
      SET password FOR 'root'@'localhost' = 
      password('YOUR_ROOT_PASSWORD_HERE');
      FLUSH PRIVILEGES;
      quit
    #+END_SRC

    où ~YOUR_ROOT_PASSWORD_HERE~ est à remplacer par le mot de passe souhaité.

** Création d'une nouvelle base de données et d'un gestionnaire pour assurer sa gestion 

*** Login en tant que ~root~  

    Maintenant, nous pouvons nous connecter en tant que ~root~:

   #+NAME: loginrootpwd
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t
   #+BEGIN_SRC shell
     mysql -u root -p
   #+END_SRC

   Il faudra fournir le mot de passe renseigné à l'étape précédente.

*** Commandes de base à la disposition de l'administrateur

   - Afficher le statut du serveur:\\
 
     #+NAME: showstatus
     #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t
     #+BEGIN_SRC sql
       SHOW STATUS;
     #+END_SRC

   - Créer une nouvelle base de données:\\

     #+NAME: createdatabase2
     #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t
     #+BEGIN_SRC sql
       CREATE DATABASE nom_database;
     #+END_SRC

   - Lister les bases de données:\\

     #+NAME: showdatabases
     #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t
     #+BEGIN_SRC sql
       SHOW DATABASES;
     #+END_SRC

   - Effacer une base de donnée:\\
 
     #+NAME: dropdatabase
     #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t
     #+BEGIN_SRC sql
       DROP DATABASE nom_database;
     #+END_SRC





*** Création de la nouvelle base de données =bd_gestion_des_notes=:
    #+NAME: createdatabase
    #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
    #+BEGIN_SRC sql
      CREATE DATABASE bd_gestion_des_notes;
      SHOW DATABASES;
    #+END_SRC

*** Création d'un utilisateur =gestionnaire=
    Utilisateur à qui ~root~ va donner les droits nécessaires pour créer ou modifier des tables dans la base de données =bd_gestion_des_notes= ou pour inscrire des utilisateurs
    #+NAME: createusergestionnaire
    #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
    #+BEGIN_SRC sql
      CREATE USER user_gestionnaire@localhost
      IDENTIFIED BY 'gestionnaire';
      GRANT ALL PRIVILEGES ON bd_gestion_des_notes.* 
      TO user_gestionnaire@localhost;
      quit
    #+END_SRC		

*** Effacer l'utilisateur =gestionnaire=

    #+NAME: createusergestionnaire
    #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
    #+BEGIN_SRC sql
      DROP USER user_gestionnaire@localhost;
    #+END_SRC		


* Afficher les utilisateurs
** Afficher tous les utilisateurs (en tant qu'administrateur)

   Connecté en ~root~ saisir la commande:
   #+NAME: showallusers
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     select host, user from mysql.user;
   #+END_SRC

** Afficher l'utilisateur connecté

   Deux commandes possibles pour cela:
   #+NAME: showcurrentuser
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     SELECT current_user;
   #+END_SRC

   ou 

   #+NAME: showcurrentuser2
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     SELECT user();
   #+END_SRC


