installationOSX.html



<div id="outline-container-orgde26c4d" class="outline-4">
<h4 id="orgde26c4d"><span class="section-number-4">1.6.2</span> À la création</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
<b>À la création, la base de donnée est initialisée avec 2 comptes:</b> 
</p>
<ul class="org-ul">
<li>le premier correspond au nom d'utilisateur actuel (checké avec la commande <code>whoami</code>); il ne nécessite pas de mot de passe;</li>
<li>tandis que le second est le compte administrateur <code>root</code> ; il est inaccessible tant qu'on n'a pas défini de mot de passe.</li>
</ul>

<p>
On va donc faire ce qu'il faut pour activer l'accès au compte administrateur (root) puis s'y connecter pour créer une base de données (<code>bd_gestion_des_notes</code>) et un compte gestionnaire.  
</p>
</div>
</div>

<div id="outline-container-org5036a33" class="outline-4">
<h4 id="org5036a33"><span class="section-number-4">1.6.3</span> Activer l'accès au compte <code>root</code></h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Pour cela, d'abord se connecter au client <b>mysql</b>  avec son nom d'utilisateur:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="orgf184193">mysql -u $(whoami)
</pre>
</div>

<p>
Puis, grâce au commandes du client <b>mysql</b>, définir le mot de passe de <code>root</code>:
</p>

<div class="org-src-container">
<pre class="src src-sql" id="org998c4e4">SHOW databases;
USE mysql;
<span style="color: #a020f0;">SET</span> password <span style="color: #a020f0;">FOR</span> <span style="color: #8b2252;">'root'</span>@<span style="color: #8b2252;">'localhost'</span> = 
password(<span style="color: #8b2252;">'YOUR_ROOT_PASSWORD_HERE'</span>);
FLUSH <span style="color: #a020f0;">PRIVILEGES</span>;
quit
</pre>
</div>

<p>
où <code>YOUR_ROOT_PASSWORD_HERE</code> est à remplacer par le mot de passe souhaité.
</p>
</div>
</div>
</div>

<div id="outline-container-org37e075d" class="outline-3">
<h3 id="org37e075d"><span class="section-number-3">1.7</span> Création d'une nouvelle base de données et d'un gestionnaire pour assurer sa gestion</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgab33a49" class="outline-4">
<h4 id="orgab33a49"><span class="section-number-4">1.7.1</span> Login en tant que <code>root</code></h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
Maintenant, nous pouvons nous connecter en tant que <code>root</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org9acefc9">mysql -u root -p
</pre>
</div>

<p>
Il faudra fournir le mot de passe renseigné à l'étape précédente.
</p>
</div>
</div>

<div id="outline-container-org214766a" class="outline-4">
<h4 id="org214766a"><span class="section-number-4">1.7.2</span> Commandes de base à la disposition de l'administrateur</h4>
<div class="outline-text-4" id="text-1-7-2">
<ul class="org-ul">
<li><p>
Afficher le statut du serveur:<br />
</p>

<div class="org-src-container">
<pre class="src src-sql" id="orga9da707">SHOW STATUS;
</pre>
</div></li>

<li><p>
Créer une nouvelle base de données:<br />
</p>

<div class="org-src-container">
<pre class="src src-sql" id="org7cc522d"><span style="color: #a020f0;">CREATE</span> DATABASE nom_database;
</pre>
</div></li>

<li><p>
Lister les bases de données:<br />
</p>

<div class="org-src-container">
<pre class="src src-sql" id="orgc6c8a34">SHOW DATABASES;
</pre>
</div></li>

<li><p>
Effacer une base de donnée:<br />
</p>

<div class="org-src-container">
<pre class="src src-sql" id="org83d6c46"><span style="color: #a020f0;">DROP</span> DATABASE nom_database;
</pre>
</div></li>
</ul>
</div>
</div>





<div id="outline-container-org75d6fb5" class="outline-4">
<h4 id="org75d6fb5"><span class="section-number-4">1.7.3</span> Création de la nouvelle base de données <code>bd_gestion_des_notes</code>:</h4>
<div class="outline-text-4" id="text-1-7-3">
<div class="org-src-container">
<pre class="src src-sql" id="orga23392f"><span style="color: #a020f0;">CREATE</span> DATABASE bd_gestion_des_notes;
SHOW DATABASES;
</pre>
</div>
</div>
</div>

<div id="outline-container-org543b743" class="outline-4">
<h4 id="org543b743"><span class="section-number-4">1.7.4</span> Création d'un utilisateur <code>gestionnaire</code></h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
Utilisateur à qui <code>root</code> va donner les droits nécessaires pour créer ou modifier des tables dans la base de données <code>bd_gestion_des_notes</code> ou pour inscrire des utilisateurs
</p>
<div class="org-src-container">
<pre class="src src-sql" id="org7f833b6"><span style="color: #a020f0;">CREATE</span> <span style="color: #483d8b;">USER</span> user_gestionnaire@localhost
IDENTIFIED <span style="color: #a020f0;">BY</span> <span style="color: #8b2252;">'gestionnaire'</span>;
<span style="color: #a020f0;">GRANT</span> <span style="color: #a020f0;">ALL</span> <span style="color: #a020f0;">PRIVILEGES</span> <span style="color: #a020f0;">ON</span> bd_gestion_des_notes.* 
<span style="color: #a020f0;">TO</span> user_gestionnaire@localhost;
quit
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e93778" class="outline-4">
<h4 id="org8e93778"><span class="section-number-4">1.7.5</span> Effacer l'utilisateur <code>gestionnaire</code></h4>
<div class="outline-text-4" id="text-1-7-5">
<div class="org-src-container">
<pre class="src src-sql" id="org44fbcba"><span style="color: #a020f0;">DROP</span> <span style="color: #483d8b;">USER</span> user_gestionnaire@localhost;
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orge2193bf" class="outline-2">
<h2 id="orge2193bf"><span class="section-number-2">2</span> Afficher les utilisateurs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1d8092f" class="outline-3">
<h3 id="org1d8092f"><span class="section-number-3">2.1</span> Afficher tous les utilisateurs (en tant qu'administrateur)</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Connecté en <code>root</code> saisir la commande:
</p>
<div class="org-src-container">
<pre class="src src-sql" id="org1e60833"><span style="color: #a020f0;">select</span> <span style="color: #a020f0;">host</span>, <span style="color: #483d8b;">user</span> <span style="color: #a020f0;">from</span> mysql.<span style="color: #483d8b;">user</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org54b6b1a" class="outline-3">
<h3 id="org54b6b1a"><span class="section-number-3">2.2</span> Afficher l'utilisateur connecté</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Deux commandes possibles pour cela:
</p>
<div class="org-src-container">
<pre class="src src-sql" id="orgc24f2a0"><span style="color: #a020f0;">SELECT</span> <span style="color: #483d8b;">current_user</span>;
</pre>
</div>

<p>
ou 
</p>

<div class="org-src-container">
<pre class="src src-sql" id="org271c503"><span style="color: #a020f0;">SELECT</span> <span style="color: #483d8b;">user</span>();
</pre>
</div>
</div>
</div>
</div>
