installationOSX.tex



\subsubsection{À la création}
\label{sec:orgf19e4ac}

\textbf{À la création, la base de donnée est initialisée avec 2 comptes:} 
\begin{itemize}
\item le premier correspond au nom d'utilisateur actuel (checké avec la commande \texttt{whoami}); il ne nécessite pas de mot de passe;
\item tandis que le second est le compte administrateur \texttt{root} ; il est inaccessible tant qu'on n'a pas défini de mot de passe.
\end{itemize}

On va donc faire ce qu'il faut pour activer l'accès au compte administrateur (root) puis s'y connecter pour créer une base de données (\texttt{bd\_gestion\_des\_notes}) et un compte gestionnaire.  

\subsubsection{Activer l'accès au compte \texttt{root}}
\label{sec:org687c8f8}

Pour cela, d'abord se connecter au client \textbf{mysql}  avec son nom d'utilisateur:

\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
mysql -u $(whoami)
\end{minted}

Puis, grâce au commandes du client \textbf{mysql}, définir le mot de passe de \texttt{root}:

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t]{sql}
show databases;
use mysql;
SET password FOR 'root'@'localhost' = 
password('YOUR_ROOT_PASSWORD_HERE');
flush PRIVILEGES;
quit
\end{minted}

où \texttt{YOUR\_ROOT\_PASSWORD\_HERE} est à remplacer par le mot de passe souhaité.

\subsection{Création d'une nouvelle base de données et d'un gestionnaire pour assurer sa gestion}
\label{sec:org5429560}

\subsubsection{Login en tant que \texttt{root}}
\label{sec:orgabafa6a}

Maintenant, nous pouvons nous connecter en tant que \texttt{root}:

\begin{minted}[,frame=single, label = \textrm{\textbf{shell}}, labelposition = topline, samepage = t]{shell}
mysql -u root -p
\end{minted}

Il faudra fournir le mot de passe renseigné à l'étape précédente.

\subsubsection{Commandes de base à la disposition de l'administrateur}
\label{sec:orge64b829}

\begin{itemize}
\item Afficher le statut du serveur:\\

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t]{sql}
SHOW STATUS;
\end{minted}

\item Créer une nouvelle base de données:\\

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t]{sql}
CREATE DATABASE nom_database;
\end{minted}

\item Lister les bases de données:\\

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t]{sql}
SHOW DATABASES;
\end{minted}

\item Effacer une base de donnée:\\

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}}, labelposition = topline, samepage = t]{sql}
DROP DATABASE nom_database;
\end{minted}
\end{itemize}





\subsubsection{Création de la nouvelle base de données \texttt{bd\_gestion\_des\_notes}:}
\label{sec:orgaceb3a3}
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
CREATE DATABASE bd_gestion_des_notes;
SHOW DATABASES;
\end{minted}

\subsubsection{Création d'un utilisateur \texttt{gestionnaire}}
\label{sec:org3f6b739}
Utilisateur à qui \texttt{root} va donner les droits nécessaires pour créer ou modifier des tables dans la base de données \texttt{bd\_gestion\_des\_notes} ou pour inscrire des utilisateurs
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
CREATE USER user_gestionnaire@localhost
IDENTIFIED BY 'gestionnaire';
GRANT ALL PRIVILEGES ON bd_gestion_des_notes.* 
TO user_gestionnaire@localhost;
quit
\end{minted}

\subsubsection{Effacer l'utilisateur \texttt{gestionnaire}}
\label{sec:org6fb41f8}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
DROP USER user_gestionnaire@localhost;
\end{minted}


\section{Afficher les utilisateurs}
\label{sec:orgd7e5647}
\subsection{Afficher tous les utilisateurs (en tant qu'administrateur)}
\label{sec:orgf71ae18}

Connecté en \texttt{root} saisir la commande:
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
select host, user from mysql.user;
\end{minted}

\subsection{Afficher l'utilisateur connecté}
\label{sec:orgcb42eb0}

Deux commandes possibles pour cela:
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
SELECT current_user;
\end{minted}

ou 

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
SELECT user();
\end{minted}
