installationOSX.org
* Gestion de la base de données

** Se connecter au client ~mysql~ en tant que gestionnaire

   #+NAME: connectgestionnaire
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     mysql -u user_gestionnaire -p
   #+END_SRC

   Saisir le mot de passe précédemment défini. 


** Lister les bases de données (auxquelles le gestionnaire a accès)

   #+NAME: showdatabases2
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     SHOW DATABASES;
   #+END_SRC

** Se connecter à une base de données
   Pour utiliser la base de donnée ~bd_gestion_des_notes~:
 
   #+NAME: usebd_gestion_des_notes
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     USE bd_gestion_des_notes;      
   #+END_SRC

** Afficher les tables de la base courante

   #+NAME: showtables
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     SHOW TABLES;
   #+END_SRC

** Afficher la structure de la table

   #+NAME: describetable
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
  #+BEGIN_SRC sql
    DESCRIBLE nom_table;
  #+END_SRC

** Créer une nouvelle table

   #+NAME: createtable
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     CREATE TABLE nom_table (
     nom_colonne1 int,
     nom_colonne2 VARCHAR(100)
     );
   #+END_SRC
 
** Ajouter une colonne à une table
   #+NAME: addcolumn
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     ALTER TABLE nom_table ADD nom_colonne type_colonne;
   #+END_SRC
 
** Effacer une colonne
   #+NAME: deletecolumn
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql 
     ALTER TABLE nom_table DROP COLUMN nom_colonne;
   #+END_SRC
 
** Effacer une table
   #+NAME: deletetable
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     DROP nom_table;
   #+END_SRC
 
** Afficher le contenu de la table
   #+NAME: showtable
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{sql}}, 
   #+BEGIN_SRC sql
     SELECT * FROM nom_table;
   #+END_SRC

* sql-mode dans emacs

** Se connecter au serveur dans emacs

   ~M-x sql-mysql~

   Renseigner:
   - User: ~user_gestionnaire~
   - Password: ~gestionnaire~
   - Database : ~bd_gestion_des_notes~
   - Server: ~localhost~

** Si emacs ne trouve pas le programme mysql
   - Déterminer l'emplacement de ~mysql~
   #+NAME: whishsql
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{shell}}, 
   #+BEGIN_SRC shell
     which mysql
   #+END_SRC
   retourne ~/usr/local/bin/mysql~

   - modifier ~.emacs.d/init.el~
   Emacs uses the directories listed in the exec-path variable to look for programs. You can add to it like so:

   #+NAME: execpath
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{elisp}}, 
   #+BEGIN_SRC elisp
     (add-to-list 'exec-path "/usr/local/bin")
   #+END_SRC

** Connexion facilitée 
   À placer dans ~.emacs.d/init.el~
   #+NAME: connexionfacile
   #+ATTR_LATEX: :options frame=single, label = \textrm{\textbf{elisp}}, 
   #+BEGIN_SRC elisp
     (setq sql-user "user_gestionnaire")
     (setq sql-password "gestionnaire")
     (setq sql-database "bd_gestion_des_notes")
     (setq sql-server "localhost")
   #+END_SRC

** SQL-UPCASE
   https://www.emacswiki.org/emacs/SqlUpcase
   A minor mode which converts lower-case SQL keywords to upper-case as you type or otherwise insert text in the buffer – for instance, killing and yanking an entire SQL query would upcase all keywords in that query.
   Commands are also provided for upcasing all keywords in the buffer (‘sql-upcase-buffer’), or a specified region (‘sql-upcase-region’).
   #+BEGIN_SRC elisp
     (when (require 'sql-upcase nil :noerror)
       (add-hook 'sql-mode-hook 'sql-upcase-mode)
       (add-hook 'sql-interactive-mode-hook 'sql-upcase-mode))
   #+END_SRC


