installationOSX.html


<div id="outline-container-org5984159" class="outline-2">
<h2 id="org5984159"><span class="section-number-2">3</span> Gestion de la base de données</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf0fdbe1" class="outline-3">
<h3 id="orgf0fdbe1"><span class="section-number-3">3.1</span> Se connecter au client <code>mysql</code> en tant que gestionnaire</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sql" id="org2ca2b27">mysql -u user_gestionnaire -p
</pre>
</div>

<p>
Saisir le mot de passe précédemment défini. 
</p>
</div>
</div>


<div id="outline-container-org8055562" class="outline-3">
<h3 id="org8055562"><span class="section-number-3">3.2</span> Lister les bases de données (auxquelles le gestionnaire a accès)</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sql" id="orgd28d4b4">SHOW DATABASES;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0baed5" class="outline-3">
<h3 id="orgf0baed5"><span class="section-number-3">3.3</span> Se connecter à une base de données</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Pour utiliser la base de donnée <code>bd_gestion_des_notes</code>:
</p>

<div class="org-src-container">
<pre class="src src-sql" id="orgf925a50">USE bd_gestion_des_notes;      
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc85dbc7" class="outline-3">
<h3 id="orgc85dbc7"><span class="section-number-3">3.4</span> Afficher les tables de la base courante</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-sql" id="org6f558fc">SHOW TABLES;
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9be747" class="outline-3">
<h3 id="orga9be747"><span class="section-number-3">3.5</span> Afficher la structure de la table</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-sql" id="orgd4b6cdf">DESCRIBLE nom_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d45def" class="outline-3">
<h3 id="org0d45def"><span class="section-number-3">3.6</span> Créer une nouvelle table</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-sql" id="org26fa77c"><span style="color: #a020f0;">CREATE</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">nom_table</span> (
nom_colonne1 <span style="color: #228b22;">int</span>,
nom_colonne2 <span style="color: #228b22;">VARCHAR</span>(100)
);
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d49039" class="outline-3">
<h3 id="org1d49039"><span class="section-number-3">3.7</span> Ajouter une colonne à une table</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-sql" id="orgce6381e"><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">nom_table</span> <span style="color: #a020f0;">ADD</span> nom_colonne type_colonne;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4f0e09" class="outline-3">
<h3 id="orgb4f0e09"><span class="section-number-3">3.8</span> Effacer une colonne</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-sql" id="org7b831be"><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: #0000ff;">nom_table</span> <span style="color: #a020f0;">DROP</span> <span style="color: #a020f0;">COLUMN</span> nom_colonne;
</pre>
</div>
</div>
</div>

<div id="outline-container-org62732fc" class="outline-3">
<h3 id="org62732fc"><span class="section-number-3">3.9</span> Effacer une table</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-sql" id="org5f70557"><span style="color: #a020f0;">DROP</span> nom_table;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbadb7a5" class="outline-3">
<h3 id="orgbadb7a5"><span class="section-number-3">3.10</span> Afficher le contenu de la table</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">
<pre class="src src-sql" id="org8f1862e"><span style="color: #a020f0;">SELECT</span> * <span style="color: #a020f0;">FROM</span> nom_table;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd208426" class="outline-2">
<h2 id="orgd208426"><span class="section-number-2">4</span> sql-mode dans emacs</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgb56953d" class="outline-3">
<h3 id="orgb56953d"><span class="section-number-3">4.1</span> Se connecter au serveur dans emacs</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>M-x sql-mysql</code>
</p>

<p>
Renseigner:
</p>
<ul class="org-ul">
<li>User: <code>user_gestionnaire</code></li>
<li>Password: <code>gestionnaire</code></li>
<li>Database : <code>bd_gestion_des_notes</code></li>
<li>Server: <code>localhost</code></li>
</ul>
</div>
</div>

<div id="outline-container-org79ce72a" class="outline-3">
<h3 id="org79ce72a"><span class="section-number-3">4.2</span> Si emacs ne trouve pas le programme mysql</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Déterminer l'emplacement de <code>mysql</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell" id="org154a872"><span style="color: #483d8b;">which</span> mysql
</pre>
</div>
<p>
retourne <code>/usr/local/bin/mysql</code>
</p>

<ul class="org-ul">
<li>modifier <code>.emacs.d/init.el</code></li>
</ul>
<p>
Emacs uses the directories listed in the exec-path variable to look for programs. You can add to it like so:
</p>

<div class="org-src-container">
<pre class="src src-elisp" id="orgaec57fc">(add-to-list 'exec-path <span style="color: #8b2252;">"/usr/local/bin"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org639aa5c" class="outline-3">
<h3 id="org639aa5c"><span class="section-number-3">4.3</span> Connexion facilitée</h3>
<div class="outline-text-3" id="text-4-3">
<p>
À placer dans <code>.emacs.d/init.el</code>
</p>
<div class="org-src-container">
<pre class="src src-elisp" id="org7a879ca">(<span style="color: #a020f0;">setq</span> sql-user <span style="color: #8b2252;">"user_gestionnaire"</span>)
(<span style="color: #a020f0;">setq</span> sql-password <span style="color: #8b2252;">"gestionnaire"</span>)
(<span style="color: #a020f0;">setq</span> sql-database <span style="color: #8b2252;">"bd_gestion_des_notes"</span>)
(<span style="color: #a020f0;">setq</span> sql-server <span style="color: #8b2252;">"localhost"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3a75d1" class="outline-3">
<h3 id="orgc3a75d1"><span class="section-number-3">4.4</span> SQL-UPCASE</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<a href="https://www.emacswiki.org/emacs/SqlUpcase">https://www.emacswiki.org/emacs/SqlUpcase</a>
A minor mode which converts lower-case SQL keywords to upper-case as you type or otherwise insert text in the buffer – for instance, killing and yanking an entire SQL query would upcase all keywords in that query.
Commands are also provided for upcasing all keywords in the buffer (‘sql-upcase-buffer’), or a specified region (‘sql-upcase-region’).
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a020f0;">when</span> (<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">sql-upcase</span> nil <span style="color: #483d8b;">:noerror</span>)
  (add-hook 'sql-mode-hook 'sql-upcase-mode)
  (add-hook 'sql-interactive-mode-hook 'sql-upcase-mode))
</pre>
</div>
</div>
</div>
</div>
