installationOSX.tex


\section{Gestion de la base de données}
\label{sec:org87aa770}

\subsection{Se connecter au client \texttt{mysql} en tant que gestionnaire}
\label{sec:org5ba62e6}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
mysql -u user_gestionnaire -p
\end{minted}

Saisir le mot de passe précédemment défini. 


\subsection{Lister les bases de données (auxquelles le gestionnaire a accès):}
\label{sec:orge98eb96}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
SHOW DATABASES;
\end{minted}

\subsection{Choisir d'utiliser la base de donnée \texttt{bd\_gestion\_des\_notes}}
\label{sec:orgf05827b}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
use bd_gestion_des_notes;      
\end{minted}


\subsection{Afficher les tables de la base courante:}
\label{sec:org388e285}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
SHOW TABLES;
\end{minted}

\subsection{Afficher la structure de la table:}
\label{sec:org4d98a60}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
DESCRIBLE nom_table;
\end{minted}

\subsection{Créer une nouvelle table:}
\label{sec:orgf75a940}

\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
CREATE TABLE nom_table (
nom_colonne1 int,
nom_colonne2 VARCHAR(100)
);
\end{minted}

\subsection{Ajouter une colonne à une table:}
\label{sec:orgdcd58c5}
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
ALTER TABLE nom_table ADD nom_colonne type_colonne;
\end{minted}

\subsection{Effacer une colonne:}
\label{sec:org5a24125}
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
ALTER TABLE nom_table DROP COLUMN nom_colonne;
\end{minted}

\subsection{Effacer une table:}
\label{sec:org15125f3}
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
DROP nom_table;
\end{minted}

\subsection{Afficher le contenu de la table:}
\label{sec:org636b602}
\begin{minted}[,frame=single, label = \textrm{\textbf{sql}},]{sql}
SELECT * FROM nom_table;
\end{minted}






\section{sql-mode dans emacs}
\label{sec:org6340d34}

\subsection{Se connecter au serveur dans emacs}
\label{sec:org5ffab25}

\texttt{M-x sql-mysql}

Renseigner:
\begin{itemize}
\item User: \texttt{user\_gestionnaire}
\item Password: \texttt{gestionnaire}
\item Database : \texttt{bd\_gestion\_des\_notes}
\item Server: \texttt{localhost}
\end{itemize}

\subsection{Si emacs ne trouve pas le programme mysql}
\label{sec:orga02b682}
\begin{itemize}
\item Déterminer l'emplacement de \texttt{mysql}
\end{itemize}
\begin{minted}[,frame=single, label = \textrm{\textbf{shell}},]{shell}
which mysql
\end{minted}
retourne \texttt{/usr/local/bin/mysql}

\begin{itemize}
\item modifier \texttt{.emacs.d/init.el}
\end{itemize}
Emacs uses the directories listed in the exec-path variable to look for programs. You can add to it like so:

\begin{minted}[,frame=single, label = \textrm{\textbf{elisp}},]{elisp}
(add-to-list 'exec-path "/usr/local/bin")
\end{minted}

\subsection{Connexion facilitée}
\label{sec:orgc8fa61e}
À placer dans \texttt{.emacs.d/init.el}
\begin{minted}[,frame=single, label = \textrm{\textbf{elisp}},]{elisp}
(setq sql-user "user_gestionnaire")
(setq sql-password "gestionnaire")
(setq sql-database "bd_gestion_des_notes")
(setq sql-server "localhost")
\end{minted}

\subsection{SQL-UPCASE}
\label{sec:org1097cb0}
\url{https://www.emacswiki.org/emacs/SqlUpcase}
A minor mode which converts lower-case SQL keywords to upper-case as you type or otherwise insert text in the buffer – for instance, killing and yanking an entire SQL query would upcase all keywords in that query.
Commands are also provided for upcasing all keywords in the buffer (‘sql-upcase-buffer’), or a specified region (‘sql-upcase-region’).
\begin{minted}[]{elisp}
(when (require 'sql-upcase nil :noerror)
  (add-hook 'sql-mode-hook 'sql-upcase-mode)
  (add-hook 'sql-interactive-mode-hook 'sql-upcase-mode))
\end{minted}
