installationOSX.org
* How to run sql script

  If you’re at the MySQL command line mysql> you have to declare the SQL file as source.

  #+BEGIN_SRC sql
    mysql> source \path\to\the\script_file.sql;
  #+END_SRC

  For example:

  #+BEGIN_SRC sql
    mysql> source \home\user\Desktop\script_file.sql;
  #+END_SRC


* Python tkinter table widget for displaying tabular data

** installation
  #+BEGIN_SRC shell
    pip install tksheet
  #+END_SRC

** source
  https://github.com/ragardner/tksheet

** paramètres
   https://github.com/ragardner/tksheet/blob/master/DOCUMENTATION.md

** fonctions
   https://github.com/ragardner/tksheet/blob/master/tksheet/_tksheet.py
