installationOSX.html


<div id="outline-container-org1a5937e" class="outline-2">
<h2 id="org1a5937e"><span class="section-number-2">5</span> How to run sql script</h2>
<div class="outline-text-2" id="text-5">
<p>
If you’re at the MySQL command line mysql&gt; you have to declare the SQL file as source.
</p>

<div class="org-src-container">
<pre class="src src-sql">mysql&gt; <span style="color: #a020f0;">source</span> \<span style="color: #a020f0;">path</span>\<span style="color: #a020f0;">to</span>\the\script_file.<span style="color: #a020f0;">sql</span>;
</pre>
</div>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-sql">mysql&gt; <span style="color: #a020f0;">source</span> \home\<span style="color: #483d8b;">user</span>\Desktop\script_file.<span style="color: #a020f0;">sql</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-orgca7534d" class="outline-2">
<h2 id="orgca7534d"><span class="section-number-2">6</span> Python tkinter table widget for displaying tabular data</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org16ca30f" class="outline-3">
<h3 id="org16ca30f"><span class="section-number-3">6.1</span> installation</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-shell">pip install tksheet
</pre>
</div>
</div>
</div>

<div id="outline-container-org16dc7df" class="outline-3">
<h3 id="org16dc7df"><span class="section-number-3">6.2</span> source</h3>
<div class="outline-text-3" id="text-6-2">
<p>
<a href="https://github.com/ragardner/tksheet">https://github.com/ragardner/tksheet</a>
</p>
</div>
</div>

<div id="outline-container-org256c095" class="outline-3">
<h3 id="org256c095"><span class="section-number-3">6.3</span> paramètres</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<a href="https://github.com/ragardner/tksheet/blob/master/DOCUMENTATION.md">https://github.com/ragardner/tksheet/blob/master/DOCUMENTATION.md</a>
</p>
</div>
</div>

<div id="outline-container-org4c510eb" class="outline-3">
<h3 id="org4c510eb"><span class="section-number-3">6.4</span> fonctions</h3>
<div class="outline-text-3" id="text-6-4">
<p>
<a href="https://github.com/ragardner/tksheet/blob/master/tksheet/_tksheet.py">https://github.com/ragardner/tksheet/blob/master/tksheet/_tksheet.py</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Raoul HATTERER</p>
<p class="date">Created: 2020-02-20 Thu 12:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
