installationOSX.tex


\section{How to run sql script}
\label{sec:orgb12d894}

If you’re at the MySQL command line mysql> you have to declare the SQL file as source.

\begin{minted}[]{sql}
mysql> source \path\to\the\script_file.sql;
\end{minted}

For example:

\begin{minted}[]{sql}
mysql> source \home\user\Desktop\script_file.sql;
\end{minted}


\section{Python tkinter table widget for displaying tabular data}
\label{sec:org1a6b6a1}

\subsection{installation}
\label{sec:org2a6dd1e}
\begin{minted}[]{shell}
pip install tksheet
\end{minted}

\subsection{source}
\label{sec:orge85f90b}
\url{https://github.com/ragardner/tksheet}

\subsection{paramètres}
\label{sec:org11498f4}
\url{https://github.com/ragardner/tksheet/blob/master/DOCUMENTATION.md}

\subsection{fonctions}
\label{sec:orgf4e994f}
\url{https://github.com/ragardner/tksheet/blob/master/tksheet/\_tksheet.py}
\end{document}